Autodesk.Revit.DB.ViewShapeBuilder.ValidateShape(System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.DirectShapeTargetViewType)
Validates a shape represented as a collection of geometry objects for use as a view-specific shape.
The objects are expected to be either points or curves. Curves are expected to be flat and lie in a plane
perpendicular to view normal as defined by view type.
Returns:
Returns true if %shape% may be used as a view-specific shape representation, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
targetViewType is not DirectShapeTargetViewType::Plan
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2017

Autodesk.Revit.DB.ViewShapeBuilder.ValidateViewType(Autodesk.Revit.DB.DirectShapeTargetViewType)
Validates the incoming view type. As of today, the only allowed view type is Plan.
Returns:
True if %targetViewType% is DirectShapeTargetViewType::Plan
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.ViewShapeBuilder.ValidateCurve(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.DirectShapeTargetViewType)
Validates curve to be added to the view-specific shape being constructed. Called by AddCurve() to validate input.
This function may be used to pre-validate the geometry being added to avoid AddCurve() throwing an InvalidArgumentException
Remarks:
Validation conditions depend on the type of view for which the shape representation is intended.
For plan views, a curve is expected to be planar and non-degenerate (e.g., NOT a circle of zero radius).
GCurve:
Curve object to be validated.
targetViewType:
View type for which this curve is intended.
Returns:
True is %GCurve% is acceptable as a part of view-specific shape representation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.ViewShapeBuilder.ValidateCurve(Autodesk.Revit.DB.Curve)
Validates curve to be added to the view-specific shape being constructed. Called by AddCurve() to validate input. Expects a valid view normal to be set prior to the call.
Remarks:
This function may be used to pre-validate the geometry being added to avoid AddCurve() throwing an InvalidArgumentException
Validation conditions depend on the type of view for which the shape representation is intended.
For plan views, a curve is expected to be planar and non-degenerate (e.g., NOT a circle of zero radius).
GCurve:
Curve object to be validated.
Returns:
True is %GCurve% is acceptable as a part of view-specific shape representation being built.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ViewShapeBuilder.Reset
Clears the accumulated geometry and resets other ViewShapeBuilder parameters to invalid values.
Since:
2015

Autodesk.Revit.DB.ViewShapeBuilder.AddCurve(Autodesk.Revit.DB.Curve)
Add a curve to the GRep associated to this ViewShapeBuilder.
GCurve:
The curve to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
GCurve is not acceptable for view-specific shape representation that is currently being built.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ViewShapeBuilder.ViewType
View type where the view-specific shape currently being built will be used
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.ViewShapeBuilder.ViewNormal
Normal of the view that will display the shape being built. Must be set explicitly before adding any geometry. Must be a unit vector.
This is used to validate incoming geometry - it must be orthogonal to the viewNormal.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: viewNormal is not length 1.0.
Since:
2015

Autodesk.Revit.DB.ViewShapeBuilder.#ctor(Autodesk.Revit.DB.DirectShapeTargetViewType)
A constructor for an ViewShapeBuilder object that takes a view type. It will infer the view normal from view type.
View normal and view type are used to validate the geometry to be stored as a view-specific shape representation of a DirectShape object.
targetViewType:
View type for which this shape representation is intended. Currently limited to Plan Views.
Throws Autodesk.Revit.Exceptions.ArgumentException:
targetViewType is not DirectShapeTargetViewType::Plan
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.ViewShapeBuilder.#ctor
Default constructor for an ViewShapeBuilder object.
Since:
2015

Autodesk.Revit.DB.ViewShapeBuilder
Builds and verifies a view-specific shape representation that would typically be stored in a DirectShape object.
Currently limited to curve-based representations for plan and elevation views.
Remarks:
The validation functionality is used by DirectShape to validate the incoming shape.
Since:
2015